icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
    memset(meshcom_settings.node_update, 0x00, sizeof(meshcom_settings.node_update));
    
    #ifndef ENABLE_SOFTSER
        bSOFTSERON=false;
    #endif

    // Umstekllung auf langes WIFI Passwort
    if(strlen(meshcom_settings.node_ossid) > 4 && strlen(meshcom_settings.node_ssid) < 5)
    {
        strcpy(meshcom_settings.node_ssid, meshcom_settings.node_ossid);
        strcpy(meshcom_settings.node_pwd, meshcom_settings.node_opwd);

        memset(meshcom_settings.node_ossid, 0x00, sizeof(meshcom_settings.node_ossid));
        memset(meshcom_settings.node_opwd, 0x00, sizeof(meshcom_settings.node_opwd));

        save_settings();
    }

    meshcom_settings.node_press = 0.0;
    meshcom_settings.node_hum = 0.0;
    meshcom_settings.node_temp = 0.0;
    meshcom_settings.node_temp2 = 0.0;
    meshcom_settings.node_press_alt = 0;
    meshcom_settings.node_press_asl = 0.0;

    global_batt = 4125.0;

    posinfo_interval = POSINFO_INTERVAL;

    if(meshcom_settings.node_postime > 0)
        posinfo_interval = meshcom_settings.node_postime;

    if(meshcom_settings.node_maxv > 0)
    {
        setMaxBatt(meshcom_settings.node_maxv * 1000.0F);
    
        global_batt = meshcom_settings.node_maxv * 1000.0F;
    }

	// Initialize onewire sensor
    // check pin number in flash
    if(meshcom_settings.node_owgpio > 7 || meshcom_settings.node_owgpio < 0){
        meshcom_settings.node_owgpio = 0;
        save_settings();
    }

    if(bONEWIRE)
    {
        init_onewire_ds18();
        init_onewire_dht();
    }
        

    //  Initialize the LoRa Module
    lora_rak4630_init();

    getMacAddr(dmac);

    _GW_ID = dmac[0] | (dmac[1] << 8) | (dmac[2] << 16) | (dmac[3] << 24);

    // BLE ID
    meshcom_settings.node_device_eui[0]=0x4D;   // M
    meshcom_settings.node_device_eui[1]=0x43;   // C
    for(int ieui=0; ieui<6; ieui++)
    {
        meshcom_settings.node_device_eui[ieui+2] = dmac[ieui];
    }


    ////////////////////////////////////////////////////////////////////
    // Initialize time
	bool boResult;
	
	// initialize clock
	boResult = MyClock.Init();
	Serial.printf("[INIT]...Initialize clock: %s\n", (boResult) ? "ok" : "FAILED");
    snprintf(cTimeSource, sizeof(cTimeSource), (char*)"INIT");

    DisplayTimeWait=0;
    //
    ////////////////////////////////////////////////////////////////////

    if(bGPSON)
    {
        //gps init
        pinMode(WB_IO2, OUTPUT);
        digitalWrite(WB_IO2, 0);
        delay(1000);
        digitalWrite(WB_IO2, 1);
        delay(1000);
        
        Serial.println("=====================================");

        Serial.println("GPS: trying 38400 baud");
        
        Serial1.begin(38400);
        Serial1.setTimeout(500);
        while (!Serial1);

        if(Serial1)
        {
            if (myGPS.begin(Serial1))
            {
                Serial.println("GPS: connected at 38400 baud");
            }
            else
            {
                Serial1.end();

                delay(100);
                Serial.println("GPS: trying 9600 baud");

                Serial1.begin(9600);
                Serial1.setTimeout(500);
                while (!Serial1);

                if(Serial1)
                {
                    if (myGPS.begin(Serial1))
                    {
                        Serial.println("GPS: connected at 9600 baud");
                    }
                    else
                    {
                        Serial.println("GPS: speed not found");
                    }
                }
                else
                    Serial.println("GPS: not connected");
            }
        }
        else
            Serial.println("GPS: not connected");

        delay(100);
    }
    else
    {
        posinfo_fix = false;
        posinfo_satcount = 0;
        posinfo_hdop = 0;
    }

    // Try to initialize!
    #if defined(LPS33)

    if(bLPS33)
    {
        Serial.println("Adafruit LPS33 check");

        if (!g_lps22hb.begin_I2C(0x5d)) 
        {
            Serial.println("Failed to find LPS33 chip");
            //while (1) 
            { 
            //  delay(10); 
            }
        }
        else
        {
            Serial.println("LPS33 sensor found");

            g_lps22hb.setDataRate(LPS22_RATE_10_HZ);

            /*
            Serial.print("Data rate set to: ");

            switch (g_lps22hb.getDataRate()) 
            {
                case LPS22_RATE_ONE_SHOT: Serial.println("One Shot / Power Down"); 
                    break;
                case LPS22_RATE_1_HZ: Serial.println("1 Hz"); 
                    break;
                case LPS22_RATE_10_HZ: Serial.println("10 Hz"); 
                    break;
                case LPS22_RATE_25_HZ: Serial.println("25 Hz"); 
                    break;
                case LPS22_RATE_50_HZ: Serial.println("50 Hz"); 
                    break;
            }
            */
        }
    }
    #endif // LPS33

    shtc3_found = false;

    #if defined(SHTC3)

    Serial.println("[INIT]...Adafruit SHTC3 check");
    if (!shtc3.begin())
    {
        Serial.println("[INIT]...Couldn't find SHTC3");
    }
    else
    {
        Serial.println("[INIT]...SHTC3 sensor found");
        shtc3_found = true;
    }

    #endif // SHTC3

    //////////////////////////////////////////////////////
    // BLE INIT

    g_enable_ble=true;

#if defined NRF52_SERIES || defined ESP32
	if (g_enable_ble)
	{
		// Init BLE
		init_ble();

        Serial.println("[INIT]...BLE init");
	}
	else
	{
		// BLE is not activated, switch off blue LED
		digitalWrite(LED_BLUE, LOW);
	}

	// Take the semaphore so the loop will go to sleep until an event happens
	xSemaphoreTake(g_task_sem, 10);
#endif

#ifdef ARDUINO_ARCH_RP2040
	// RAK11310 does not have BLE, switch off blue LED
	digitalWrite(LED_BLUE, LOW);
#endif

    // I2C init
    Wire.begin();

    #if defined(ENABLE_BMX280)
        setupBMX280(true);
    #endif

    #if defined(ENABLE_MC811)
        setupMCU811();
    #endif

    // BME680
    #if defined(ENABLE_BMX680)
        setupBME680();
    #endif

