icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
            uint16_t Hour = now.hour();
            uint16_t Minute = now.minute();
            uint16_t Second = now.second();


            // check valid Date & Time
            if(Year > 2023)
            {
                MyClock.setCurrentTime(meshcom_settings.node_utcoff, Year, Month, Day, Hour, Minute, Second);
                snprintf(cTimeSource, sizeof(cTimeSource), (char*)"RTC");
                bMyClock = true;
            }
        }
    }
    else
    if(meshcom_settings.node_hasIPaddress)
    {
        strTime = "none";

extern bool btimeClient;

        // every 15 minutes
        if(btimeClient)
        {
            if((updateTimeClient + 1000 * 60 * 15) < millis() || updateTimeClient == 0)
            {
                strTime = neth.udpUpdateTimeClient();

                updateTimeClient = millis();
            }
            else
                strTime = neth.udpGetTimeClient();

            strDate = neth.udpGetDateClient();

            uint16_t Year = (uint16_t)strDate.substring(0, 4).toInt();
            uint16_t Month = (uint16_t)strDate.substring(5, 7).toInt();
            uint16_t Day = (uint16_t)strDate.substring(8, 10).toInt();

            uint16_t Hour = (uint16_t)strTime.substring(0, 2).toInt();
            uint16_t Minute = (uint16_t)strTime.substring(3, 5).toInt();
            uint16_t Second = (uint16_t)strTime.substring(6, 8).toInt();
        
            // check valid Date & Time
            if(Year > 2023 && strTime.compareTo("none") != 0)
            {
                MyClock.setCurrentTime(meshcom_settings.node_utcoff, Year, Month, Day, Hour, Minute, Second);
                bNTPDateTimeValid = true;

                snprintf(cTimeSource, sizeof(cTimeSource), (char*)"NTP");
            }
            else
                bNTPDateTimeValid = false;
        }
    }
    else
    {
        bNTPDateTimeValid = false;
    }


    if(bMyClock)
    {
        MyClock.CheckEvent();
        
        if(MyClock.Year() > 2023)
            meshcom_settings.node_date_year = MyClock.Year();
        else
            meshcom_settings.node_date_year = 0;

        meshcom_settings.node_date_month = MyClock.Month();
        meshcom_settings.node_date_day = MyClock.Day();

        meshcom_settings.node_date_hour = MyClock.Hour();
        meshcom_settings.node_date_minute = MyClock.Minute();
        meshcom_settings.node_date_second = MyClock.Second();

        // Starttime setzen
        if(meshcom_settings.node_date_year > 2023 && meshcom_settings.node_update[0] == 0x00)
        {
            snprintf(meshcom_settings.node_update, sizeof(meshcom_settings.node_update), "%04i-%02i-%02i %02i:%02i:%02i",
             meshcom_settings.node_date_year, meshcom_settings.node_date_month, meshcom_settings.node_date_day, meshcom_settings.node_date_hour, meshcom_settings.node_date_minute, meshcom_settings.node_date_second);
        }
    }

    // Retransmission status must tick on ALL nodes (including gateways).
    // Without this, gateway text messages stay stuck at RING_STATUS_SENT
    // forever if no echo is received via LoRa (RING_ZOMBIE).
    if ((retransmit_timer + (1000 * 2)) < millis())
    {
        updateRetransmissionStatus();

        retransmit_timer = millis();
    }

    // Periodischer Ringpuffer-Auslastungsbericht (alle 30s)
    {
        static unsigned long ring_status_timer = 0;
        if(bLORADEBUG && (millis() - ring_status_timer) > 30000)
        {
            ring_status_timer = millis();
            int pending = 0, retrying = 0, done = 0;
            for(int i = 0; i < MAX_RING; i++)
            {
                if(ringBuffer[i][0] == 0) continue;
                if(ringBuffer[i][1] == 0xFF) done++;
                else if(ringBuffer[i][1] == 0x00) pending++;
                else retrying++;
            }
            int queued = (iWrite >= iRead) ? (iWrite - iRead) : (MAX_RING - iRead + iWrite);
            Serial.printf("[MC-DBG] RING_STATUS queued=%d pending=%d retrying=%d done=%d iW=%d iR=%d\n",
                queued, pending, retrying, done, iWrite, iRead);
        }
    }

    // Deferred display update from OnRxDone (avoid I2C inside radio callback)
    if(bPendingDisplayText)
    {
        sendDisplayText(pendingDisplayMsg, pendingDisplayRssi, pendingDisplaySnr);
        bPendingDisplayText = false;
    }
    if(bPendingDisplayPos)
    {
        sendDisplayPosition(pendingDisplayMsg, pendingDisplayRssi, pendingDisplaySnr);
        bPendingDisplayPos = false;
    }

    // Channel utilization report (every 10s)
    {
        static unsigned long ch_util_timer = 0;
        if(bLORADEBUG && (millis() - ch_util_timer) > 10000)
        {
            unsigned long window = millis() - ch_util_timer;
            ch_util_timer = millis();
            unsigned long rx_ms = ch_util_rx_accum;
            unsigned long tx_ms = ch_util_tx_accum;
            ch_util_rx_accum = 0;
            ch_util_tx_accum = 0;
            unsigned int util = (unsigned int)((rx_ms + tx_ms) * 100 / window);
            if(util > 100) util = 100;
            Serial.printf("[MC-DBG] CHANNEL_UTIL rx=%lums tx=%lums util=%u%%\n",
                rx_ms, tx_ms, util);
            // ONRXDONE stats: report max and warn count, then reset
            Serial.printf("[MC-DBG] ONRXDONE_STATS max=%lums warn=%u (>%dms)\n",
                onrxdone_max_ms, onrxdone_warn_count, ONRXDONE_WARN_MS);
            onrxdone_max_ms = 0;
            onrxdone_warn_count = 0;        }
    }

    if(iReceiveTimeOutTime > 0)
    {
        if((iReceiveTimeOutTime + csma_timeout) < millis())
        {
            if(bLORADEBUG)
                Serial.printf("[MC-DBG] RX_TIMEOUT_FIRE ts=%lu wait=%lu delta=%lu\n",
                    millis(), csma_timeout, millis() - iReceiveTimeOutTime);

            // BUG #1 Aequivalent: Wenn Header erkannt, ist Empfang moeglicherweise
            // noch aktiv. Timer verlaengern statt zuruecksetzen.
            if(is_receiving && rx_irq_defer_count < 3)
            {
                rx_irq_defer_count++;
                iReceiveTimeOutTime = millis();
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] RX_TIMEOUT_DEFERRED src=is_receiving cnt=%d\n", rx_irq_defer_count);
            }
            else
            {
                if(rx_irq_defer_count >= 3 && bLORADEBUG)
                    Serial.printf("[MC-DBG] RX_IRQ_STALE forced restart after %d deferrals\n", rx_irq_defer_count);
                rx_irq_defer_count = 0;
                iReceiveTimeOutTime = 0;
                Radio.Rx(RX_TIMEOUT_VALUE);
                if(bLORADEBUG)
                {
                    Serial.printf("[MC-SM] IDLE -> RX_LISTEN rc=0\n");
                    Serial.printf("[MC-DBG] RX_RESTART src=timeout\n");
                }
            }
        }
    }

    if(iReceiveTimeOutTime == 0 && is_receiving == false && tx_is_active == false)
    {
        if (iWrite != iRead)
        {
            if(!cad_in_progress && !cad_done_flag)
            {
                // Start CAD scan
                if(bLORADEBUG)
                {
                    Serial.printf("[MC-SM] IDLE -> TX_PREPARE rc=0\n");
                    Serial.printf("[MC-DBG] TX_GATE_ENTER qlen=%d cad_attempt=%d\n",
                        (iWrite >= iRead) ? (iWrite - iRead) : (MAX_RING - iRead + iWrite),
                        cad_attempt);
                }

                cad_in_progress = true;
                cad_done_flag = false;
                cad_double_check = false;
                cad_start_time = millis();
                Radio.Standby();
                Radio.StartCad();
            }
            else if(cad_done_flag)
            {
                cad_in_progress = false;
                cad_done_flag = false;
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] CAD_SCAN result=%d\n", cad_channel_busy ? -702 : 0);

                if(!cad_channel_busy)
                {
                    if(cad_double_check && bLORADEBUG)
                        Serial.printf("[MC-DBG] CAD_FALSE_POSITIVE\n");
                    // Channel free — transmit
                    if(bLORADEBUG)
                    {
                        Serial.printf("[MC-SM] TX_PREPARE -> TX_ACTIVE rc=0\n");
                        Serial.printf("[MC-DBG] CAD_FREE attempt=%d\n", cad_attempt);
                    }

                    ch_util_tx_start = millis();
                    csma_reset();
                    doTX();
                }
                else if(!cad_double_check)
                {
                    // First scan busy — double-check
                    if(bLORADEBUG)
                        Serial.printf("[MC-DBG] CAD_BUSY_1 attempt=%d, double-check...\n", cad_attempt);

                    cad_double_check = true;
                    cad_in_progress = true;
                    cad_done_flag = false;
                    cad_start_time = millis();
                    Radio.Standby();
                    Radio.StartCad();
                }
                else
                {
                    // Double-check confirmed busy — backoff
                    cad_attempt++;
                    csma_timeout = csma_compute_timeout(cad_attempt);

