icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
                    if(bLORADEBUG)
                    {
                        Serial.printf("[MC-SM] TX_PREPARE -> IDLE rc=-1\n");
                        Serial.printf("[MC-DBG] CAD_BUSY attempt=%d next_timeout=%lu\n",
                            cad_attempt, csma_timeout);
                    }

                    Radio.Rx(RX_TIMEOUT_VALUE);
                    iReceiveTimeOutTime = millis();
                }
            }
            else if(cad_in_progress && (millis() - cad_start_time > 100))
            {
                // Safety timeout: CadDone never fired
                if(bLORADEBUG)
                    Serial.printf("[MC-DBG] CAD_SAFETY_TIMEOUT\n");

                cad_in_progress = false;
                cad_done_flag = false;
                Radio.Rx(RX_TIMEOUT_VALUE);
                iReceiveTimeOutTime = millis();
            }
        }
    }

    // SOFTSER
    #if defined(ENABLE_SOFTSER)
    if(bSOFTSERON)
    {
        // check every 5 seconds to ready next telemetry via serial interface
        if ((softser_refresh_timer + 5000) < millis() && softserFunktion == 0)
        {
            if(lastSOFTSER_MINUTE != meshcom_settings.node_date_minute)
            {
                if(meshcom_settings.node_date_minute % SOFTSER_REFRESH_INTERVAL  == 0)
                {
                    lastSOFTSER_MINUTE = meshcom_settings.node_date_minute;

                    // start SOFTSER APP
                    loopSOFTSER(SOFTSER_APP_ID);
                }
            }

            softser_refresh_timer = millis();
        }
        else
        if (bSOFTSER_APP)
        {
            bSOFTSER_APP = false;

            softserFunktion = 0;

            lastSOFTSER_MINUTE = meshcom_settings.node_date_minute;
            
            // start SOFTSER APP
            loopSOFTSER(SOFTSER_APP_ID);
        }
        else
        {
            appSOFTSER(SOFTSER_APP_ID);
        }
    }
    #endif

    btn.tick();

    // check if message from phone to send
    if(hasMsgFromPhone)
    {
        if(memcmp(textbuff_phone, ":", 1) == 0)
            sendMessage(textbuff_phone, txt_msg_len_phone);

        if(memcmp(textbuff_phone, "-", 1) == 0)
            commandAction(textbuff_phone, isPhoneReady, true);

        hasMsgFromPhone = false;
    }

    #if defined(ENABLE_MCP23017)
    // 5 sec
    if ((mcp_refresh_timer + 5000) < millis())
    {
        // get i/o state
        if(loopMCP23017())
        {
        }

        mcp_refresh_timer = millis();
    }
    #endif

    if(gKeyNum == 1)
    {
        Serial.println("gKeyNum == 1");

        //getTEMP();

        //getPRESSURE();

        gKeyNum = 0;
    }

    if(gKeyNum == 2)
    {
        if(bGPSDEBUG)
            Serial.println("gKeyNum == 2");

        #ifdef ENABLE_GPS

        if(bGPSON)
        {
            // gps refresh every 10 sec
            if ((gps_refresh_timer + (GPS_REFRESH_INTERVAL * 1000)) < millis())
            {
                unsigned int igps = getGPS();
                if(igps > 0)
                    posinfo_interval = igps;
                else
                {
                    no_gps_reset_counter++;
                    if(no_gps_reset_counter > 10)
                    {
                        posinfo_interval = POSINFO_INTERVAL;
                        no_gps_reset_counter = 0;
                    }
                }

                gps_refresh_timer = millis();
            }
        }

        #endif

        gKeyNum = 0;
    }

    if(gKeyNum == 3)
    {
        Serial.println("Right button pressed");

        gKeyNum = 0;
    }

    #ifdef ENABLE_GPS
    if(bGPSON)
    {
        // check GPS ON and activ --> <gKeyNum == 2> the signal must be active
        if ((gps_refresh_timer + (5 * (GPS_REFRESH_INTERVAL * 1000))) < millis())
        {
            posinfo_fix = false;
            posinfo_satcount = 0;
            posinfo_hdop = 0;
            posinfo_interval = POSINFO_INTERVAL;
        }
    }
    #endif

if (isPhoneReady == 1)
    {
        if (config_to_phone_prepare)
        {
            for(int config_cmds_index=0; config_cmds_index < json_configs_cnt; config_cmds_index++)
            {
                commandAction((char*)config_cmds[config_cmds_index], isPhoneReady, true);
            }

            sendMheard();

            config_to_phone_prepare_timer=millis();

            config_to_phone_prepare = false;
        }
        else
        {
            // wait after BLE Connect 3 sec.
            if(millis() < config_to_phone_prepare_timer + 3000)
                iPhoneState = 0;

            if (iPhoneState > 3)   // only every 6 times of mainloop send to phone  RAK 2 x ESP
            {
                // prepare JSON config to phone after BLE connection
                // send JSON config to phone after BLE connection
                if (ComToPhoneWrite != ComToPhoneRead)
                {
                    sendComToPhone();   
                }
                else
                {
                    // check if we have messages for BLE to send
                    if (toPhoneWrite != toPhoneRead)
                    {
                        sendToPhone();   
                    }
                }

                iPhoneState = 0;
            }
            else
            {
                iPhoneState++;
            }
        }

        // 5 minuten
        if((config_to_phone_datetime_timer + (5 * 60 * 1000)) < millis())
        {
            bNTPDateTimeValid=false;

            config_to_phone_datetime_timer = millis();
        }
    }

    // posinfo
    //Serial.print(getTimeString());
    //Serial.printf(" posinfo_timer:%ld posinfo_interval:%ld timer:%ld millis:%ld\n", posinfo_timer, posinfo_interval, (posinfo_timer + (posinfo_interval * 1000)), millis());

    // posinfo_interval in Seconds
    if (((posinfo_timer + (posinfo_interval * 1000)) < millis()) || (millis() > 100000 && millis() < 130000 && bPosFirst) || posinfo_shot)
    {
        bPosFirst = false;
        posinfo_shot=false;
        posinfo_timer = millis();
        
        sendPosition(posinfo_interval, meshcom_settings.node_lat, meshcom_settings.node_lat_c, meshcom_settings.node_lon, meshcom_settings.node_lon_c, meshcom_settings.node_alt, meshcom_settings.node_press, meshcom_settings.node_hum, meshcom_settings.node_temp, meshcom_settings.node_temp2, meshcom_settings.node_gas_res, meshcom_settings.node_co2, meshcom_settings.node_press_alt, meshcom_settings.node_press_asl);

        posinfo_last_lat=posinfo_lat;
        posinfo_last_lon=posinfo_lon;
        posinfo_last_direction=posinfo_direction;

        if(pos_shot)
        {
            commandAction((char*)"--pos", isPhoneReady, true);
            pos_shot = false;
        }
    }

