icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
    // HEYINFO_INTERVAL in Seconds == 15 minutes
    if (((heyinfo_timer + (HEYINFO_INTERVAL * 1000)) < millis()) || bHeyFirst)
    {
        bHeyFirst = false;
        
        sendHey();

        heyinfo_timer = millis();
    }

    // TELEMETRY_INTERVAL in Minutes == 15 minutes default
    unsigned long akt_timer = meshcom_settings.node_parm_time;
    if(akt_timer < 5 || akt_timer > 120)
    {
        akt_timer = TELEMETRY_INTERVAL;
    }
    
    akt_timer = akt_timer * 1000 * 60; // in minutes

    if(iNextTelemetry < 5)
        akt_timer= 15 * 1000; // 15 Seconds PARM, UNIT, EQNS and 1st T-Message

    if (((telemetry_timer + akt_timer) < millis()) || bHeyFirst)
    {
        bHeyFirst = false;
        
        sendTelemetry(SOFTSER_APP_ID);

        telemetry_timer = millis();
    }
    
    // get UDP & send UDP message from ringBufferOut if there is one to tx
    if(bGATEWAY)
    {
        int bUDPReceived = false;

        // check if we received a UDP packet
        if (neth.hasIPaddress)
        {
            if(neth.getUDP() == 1)  // 1...no udp-paket received
            {
                sendUDP(); 
            }
            else
            {
                bUDPReceived=true;

                if(bDEBUG)
                    Serial.println("LOOP GATEWAY actions UDP received");
            }
        }
        else
        {
            //neth.last_upd_timer = 0; // ETH new
        }

        // UDP Action for next loop
        if(!bUDPReceived)
        {
            meshcom_settings.node_hasIPaddress = neth.hasIPaddress;
            meshcom_settings.node_last_upd_timer = neth.last_upd_timer;
            
            // check HB response (we also check successful sending KEEP. check if they work together!)
            if((neth.last_upd_timer + (MAX_HB_RX_TIME * 1000)) < millis())
            {
                if(bDEBUG)
                    Serial.println("LOOP GATEWAY last_upd_timer actions");

                neth.last_upd_timer = millis();

                // avoid TX and UDP
                if(!neth.hasIPaddress)
                {
                    neth.hasIPaddress = false;
                    iReceiveTimeOutTime = millis();

                    if(strlen(meshcom_settings.node_ownip) > 6 && strlen(meshcom_settings.node_ownms) > 6 && strlen(meshcom_settings.node_owngw) > 6)
                    {
                        if(bDEBUG)
                        {
                            Serial.print(getTimeString());
                            Serial.println(" [MAIN] initethETH fix-IP");
                        }

                        neth.initethfixIP();
                    }
                    else
                    {
                        Serial.print(getTimeString());
                        Serial.println(" [MAIN] initethDHCP");

                        neth.initethDHCP();
                    }
                }
            }
            
            // DHCP refresh
            if ((dhcp_timer + (DHCP_REFRESH * 60000)) < millis())
            {
                if(neth.hasETHHardware)
                {
                    // no need on static IPs
                    if(!(strlen(meshcom_settings.node_ownip) > 6 && strlen(meshcom_settings.node_ownms) > 6 && strlen(meshcom_settings.node_owngw) > 6))
                    {
                        if(bDEBUG)
                        {
                            Serial.print(getTimeString());
                            Serial.println(" [MAIN] checkDHCP");
                        }
                        
                        neth.checkDHCP();
                    }
                }

                dhcp_timer = millis();
            }
        }
    }

    #if defined(SHTC3)

    // TEMP/HUM
    if (((temphum_timer + TEMPHUM_INTERVAL) < millis()))
    {
        if(shtc3_found)
            getTEMP();

        temphum_timer = millis();
    }

    #endif

    #if defined(LPS33)

    if(bLPS33)
    {
        // DRUCK
        if (((druck_timer + DRUCK_INTERVAL) < millis()))
        {
            getPRESSURE();

            druck_timer = millis();

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }
        }
    }

    #endif

    mainStartTimeLoop();

    if(DisplayOffWait > 0)
    {
        if (millis() > DisplayOffWait)
        {
            DisplayOffWait = 0;
            if(bDisplayOff)
            {
                bDisplayIsOff=true;
                sendDisplay1306(true, true, 0, 0, (char*)"#C");
            }
        }
    }
    
    // rebootAuto
    if(rebootAuto > 0)
    {
        if (millis() > rebootAuto)
        {
            rebootAuto = 0;

            #ifdef ESP32
                ESP.restart();
            #endif
            
            #if defined NRF52_SERIES
                NVIC_SystemReset();     // resets the device
            #endif
        }
    }

    checkSerialCommand();

    if(BattTimeWait == 0)
        BattTimeWait = millis() - 31000;

    if ((BattTimeWait + 30000) < millis())
    {
        if (tx_is_active == false && is_receiving == false)
        {
            global_batt = read_batt();
            global_proz = mv_to_percent(global_batt);

            BattTimeWait = millis();
        }
    }
    

    if(bONEWIRE)
    {
        if(onewireTimeWait == 0)
            onewireTimeWait = millis() - 10000;


        if ((onewireTimeWait + 30000) < millis())  // 30 sec
        {
            //if (tx_is_active == false && is_receiving == false)
            {
                if(one_found)
                    loop_onewire_ds18();

                if(dht_found)
                    loop_onewire_dht();

                onewireTimeWait = millis();

                if(wx_shot)
                {
                    commandAction((char*)"--wx", isPhoneReady, true);
                    wx_shot = false;
                }
            }
        }
    }

    if(BMXTimeWait == 0)
        BMXTimeWait = millis() - 10000;

