icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
    if ((BMXTimeWait + 60000) < millis())   // 60 sec
    {
        // read BMX Sensor
        if(loopBMX280())
        {
            meshcom_settings.node_temp = getTemp();
            meshcom_settings.node_hum = getHum();  //BMP280 - not supported
            meshcom_settings.node_press = getPress();

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }
        }

        BMXTimeWait = millis();
    }

    // read every n seconds the bme680 sensor calculated from millis()
    #if defined(ENABLE_BMX680)
    if(bBME680ON && bme680_found)
    {
        if ((bme680_timer + 60000) < millis() || delay_bme680 <= 0)
        {
            if (delay_bme680 <= 0)
            {
                getBME680();

            }

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }

            // calculate delay
            delay_bme680 = bme680_get_endTime() - millis();

            bme680_timer = millis();
        }
    }
    #endif

    // read BMP Sensor
    #if defined(ENABLE_BMX280)
    if((bBMPON || bBMEON) && bmx_found)
    {
        if(BMXTimeWait == 0)
            BMXTimeWait = millis() - 10000;

        if ((BMXTimeWait + 30000) < millis())   // 30 sec
        {
                if(loopBMX280())
                {
                    meshcom_settings.node_press = getPress();
                    meshcom_settings.node_temp = getTemp();
                    meshcom_settings.node_hum = getHum();
                    meshcom_settings.node_press_alt = getPressALT();
                    meshcom_settings.node_press_asl = getPressASL(meshcom_settings.node_alt);
                    
                    if(wx_shot)
                    {
                        commandAction((char*)"--wx", isPhoneReady, true);
                        wx_shot = false;
                    }
                }

            BMXTimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    #if defined(ENABLE_MC811)
    if(bMCU811ON && mcu811_found)
    {
        if(MCU811TimeWait == 0)
            MCU811TimeWait = millis() - 10000;

        if ((MCU811TimeWait + 60000) < millis())   // 60 sec
        {
            // read MCU-811 Sensor
            if(loopMCU811())
            {
                meshcom_settings.node_co2 = geteCO2();
                
                if(wx_shot)
                {
                    commandAction((char*)"--wx", isPhoneReady, true);
                    wx_shot = false;
                }
            }

            MCU811TimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    #if defined(ENABLE_INA226)
    if(bINA226ON)
    {
        if(INA226TimeWait == 0)
            INA226TimeWait = millis() - 10000;

        if ((INA226TimeWait + 60000) < millis())   // 60 sec
        {
            // read INA Sensor
            if(loopINA226())
            {
                meshcom_settings.node_vbus = getvBUS();
                meshcom_settings.node_vshunt = getvSHUNT();
                meshcom_settings.node_vcurrent = getvCURRENT();
                meshcom_settings.node_vpower = getvPOWER();
            }

            INA226TimeWait = millis(); // wait for next messurement
        }
    }
    #endif

    // read every n seconds the bme680 sensor calculated from millis()
    #if defined(ENABLE_BMX680)
    if(bBME680ON && bme680_found)
    {
        if ((bme680_timer + 60000) < millis() || delay_bme680 <= 0)
        {
            if (delay_bme680 <= 0)
            {
                getBME680();

            }

            if(wx_shot)
            {
                commandAction((char*)"--wx", isPhoneReady, true);
                wx_shot = false;
            }

            // calculate delay
            delay_bme680 = bme680_get_endTime() - millis();

            bme680_timer = millis();
        }
    }
    #endif

    // heartbeat
    if (bGATEWAY)
    {
        if ((hb_timer + (HEARTBEAT_INTERVAL * 1000)) < millis())
        {
            if(bDisplayCont)
            {
                Serial.print(getTimeString());
                Serial.printf(" [UDP] sending Heartbeat\n");
            }

            sendHeartbeat();

            hb_timer = millis();
        }
    }

    if(bEXTUDP)
    {
        getExternUDP();
        flushExternQueue();
    }

    if(bWEBSERVER || bEXTUDP)
    {
        if (web_timer == 0 || ((web_timer + (HEARTBEAT_INTERVAL * 1000 * 30)) < millis()))   // repeat 15 minutes
        {
            meshcom_settings.node_hasIPaddress = neth.hasIPaddress;

            web_timer = millis();

            #ifndef BOARD_RAK4630
                // restart WEB-Client
                stopWebserver();

                if(!meshcom_settings.node_hasIPaddress)
                    startWIFI();
            #endif

            if(bWEBSERVER)
            {
                startWebserver();

            }

            if(bEXTUDP)
            {
                startExternUDP();
            }
        }

        if(bWEBSERVER)
        {
            loopWebserver(); 
        }

    }

    if(bDisplayCont)
    {
        Serial.printf("%s;[HEAP];%lu;(free)\n", getTimeString().c_str(),
            (unsigned long)nrf52_getFreeHeap());
    }

    //  We are on FreeRTOS, give other tasks a chance to run
    delay(100);

    yield();
}

/** @brief Function to check if the modem detected a preamble
 */
void blinkLED()
{
    digitalWrite(LED_GREEN, HIGH);
    delay(5);
    digitalWrite(LED_GREEN, LOW);
}

void blinkLED2()
{
    digitalWrite(LED_BLUE, HIGH);
    delay(20);
    digitalWrite(LED_BLUE, LOW);
}


/**@brief Function for handling a LoRa tx timer timeout event.
 */
void getTEMP(void)
{
    sensors_event_t humidity, temp;

    shtc3.getEvent(&humidity, &temp); // populate temp and humidity objects with fresh data

    if(bWXDEBUG)
    {
        Serial.print("Temperature: "); Serial.print(temp.temperature); Serial.println(" degrees C");
        Serial.print("Humidity: "); Serial.print(humidity.relative_humidity); Serial.println("% rH");
    }

    meshcom_settings.node_temp = temp.temperature;
    meshcom_settings.node_hum = humidity.relative_humidity;
}

/**@brief Function for handling a LoRa tx timer timeout event.
 */
void getPRESSURE(void)
{
    sensors_event_t temp;
    sensors_event_t pressure;
    
    g_lps22hb.getEvent(&pressure, &temp);

