icssw-org/MeshCom-Firmware/src/nrf52/nrf_main.cpp
                DEBUG_MSG("ERROR", "Sending UDP Packet failed!");

                err_cnt_udp_tx++;
                // if we have too much errors sending, reset UDP
                if (err_cnt_udp_tx >= MAX_ERR_UDP_TX)
                {
                    // avoid TX and UDP
                    neth.hasIPaddress = false;

                    Serial.print(getTimeString());
                    Serial.printf(" [MAIN] resetDHCP\n");

                    err_cnt_udp_tx = 0;
                    neth.resetDHCP();
                }
            }
            else
            {
                // UDP DATA Header 36 byte
                memcpy(convBuffer, ringBufferUDPout[udpRead] + 1 + 36, msg_len);

                if(convBuffer[0] == 0x3A || convBuffer[0] == 0x21 || convBuffer[0] == 0x40)
                {
                    struct aprsMessage aprsmsg;
                    
                    // print which message type we got
                    decodeAPRS(convBuffer, msg_len, aprsmsg);

                    // print aprs message
                    if(bDisplayInfo)
                    {
                        printBuffer_aprs((char*)"TX-UDP ", aprsmsg);
                        Serial.println("");
                    }
                }
            }

            // zero out sent buffer
            memset(ringBufferUDPout[udpRead], 0, UDP_TX_BUF_SIZE);

            udpRead++;
            if (udpRead >= MAX_RING_UDP) 
                udpRead = 0;

        }
        else
        {
            DEBUG_MSG("UDP", "UDP busy. Sending asap");
        }
    }
}

/**@brief Function to send our heartbeat
 * longanme0x000xAABBCCDDKEEPGW0110x00
 *               GW_ID
 */
void sendHeartbeat()
{
    if (!neth.hasIPaddress)
        return;

    sendKEEP();

}